Repository: ShubhamShinde8111/farmers_diary
Catalog: lib/l10n/intl_*.arb
Languages: hi, mr

# appTitle
source: Farmer Diary
hi: किसान डायरी
mr: शेतकरी डायरी

# welcomeMessage
source: Welcome to the Farmer Diary
hi: किसान डायरी में आपका स्वागत है
mr: शेतकरी डायरीमध्ये तुमचं स्वागत आहे

source: Select Language
hi: भाषा चुनें
mr: भाषा निवडा

source: Home
hi: होम
mr: मुख्यपृष्ठ

source: Settings
hi: सेटिंग्स
mr: सेटिंग्ज

source: Profile
hi: प्रोफ़ाइल
mr: प्रोफाइल

source: Logout
hi: लॉग आउट
mr: बाहेर पडा

source: Change Language
hi: भाषा बदलें
mr: भाषा बदला

# languageChanged
source: Language changed to Hindi
hi: भाषा हिंदी में बदल दी गई
mr: भाषा हिंदीमध्ये बदलली गेली

source: Search Farm...
hi: फार्म खोजें...
mr: शेत शोधा...

source: Add Farm
hi: फार्म जोड़ें
mr: शेत जोडा

source: Overall Expense
hi: कुल खर्च
mr: एकूण खर्च

# totalPesticide
source: Total Pesticides
hi: कुल कीटनाशक
mr: एकूण कीटकनाशक

# totalFertilizer
source: Total Fertilizers
hi: कुल उर्वरक
mr: एकूण खत

source: Total Labour
hi: कुल श्रम
mr: एकूण मजूर

# totalOther
source: Other Expenses
hi: अन्य खर्च
mr: इतर खर्च

# farmWiseExpense
source: Farm-wise Expenses
hi: फार्म अनुसार खर्च
mr: शेतानुसार खर्च

source: Edit Farm
hi: फार्म संपादित करें
mr: शेत संपादित करा

source: Archive Farm
hi: फार्म संग्रहित करें
mr: शेत संग्रहित करा

# archiveConfirmationTitle
source: Are you sure you want to archive this farm?
hi: क्या आप वाकई इस फार्म को संग्रहित करना चाहते हैं?
mr: तुम्हाला हा शेत संग्रहित करायचा आहे का?

# archiveConfirmationContent
source: Once this farm is archived, it cannot be reactivated.
hi: इस फ़ार्म को संग्रहित करने के बाद इसे पुनः सक्रिय नहीं किया जा सकता।
mr: शेत एकदा संग्रहित केल्यावर पुन्हा सक्रिय करता येणार नाही.

source: Confirm
hi: पुष्टि करें
mr: खात्री करा

# expenseSummaryUnavailable
source: Expense summary is unavailable
hi: खर्च सारांश उपलब्ध नहीं है
mr: खर्च सारांश उपलब्ध नाही

# noFarmsFound
source: No farms found. Please add a farm first.
hi: कोई फ़ार्म नहीं मिला। कृपया पहले एक फ़ार्म जोड़ें।
mr: शेती सापडली नाही. कृपया आधी शेती जोडा.

# expenseError
source: Error loading expenses
hi: खर्च लोड करते समय त्रुटि हुई
mr: खर्च लोड करण्यात त्रुटी

# cropTypeSelection
source: Select Crop Type
hi: फसल प्रकार चुनें
mr: पीक प्रकार निवडा

# plotCreation
source: Create Plot
hi: प्लॉट निर्माण करें
mr: प्लॉट तयार करा

# scheduleCreation
source: Create Schedule
hi: निर्धारित करें
mr: वेळापत्रक तयार करा

# inputPesticidesFertilizers
source: Enter Pesticides/Fertilizer details
hi: कीटनाशक/उर्वरक विवरण दर्ज करें
mr: कीटकनाशक/खत तपशील भरा

source: Edit Schedule
hi: निर्धारित शेड्यूल संपादित करें
mr: वेळापत्रक संपादित करा

source: Track Schedule
hi: निर्धारित शेड्यूल ट्रैक करें
mr: वेळापत्रक ट्रॅक करा

source: Generate Report
hi: रिपोर्ट जनरेट करें
mr: अहवाल तयार करा

# pdfReport
source: Download PDF Report
hi: पीडीएफ रिपोर्ट डाउनलोड करें
mr: PDF अहवाल डाउनलोड करा

source: Crop Type
hi: फसल प्रकार
mr: पीक प्रकार

source: Crop Name:
hi: फसल का नाम:
mr: पीकाचे नाव:

source: Select Crop
hi: फसल चुनें
mr: पीक निवडा

source: Plot Name
hi: प्लॉट नाम
mr: प्लॉटचे नाव

source: Start Date
hi: प्रारंभ तिथि
mr: प्रारंभ तारीख

# taskSchedule
source: Schedule Task
hi: कार्य निर्धारित करें
mr: कामाचे वेळापत्रक

source: Pesticide Name
hi: कीटनाशक का नाम
mr: कीटकनाशकाचे नाव

source: Quantity
hi: मात्रा
mr: प्रमाण

source: Price
hi: मूल्य
mr: किंमत

source: Remarks
hi: टिप्पणी
mr: शेरा

# hiFarmer
source: Hello Farmer
hi: नमस्ते किसान
mr: नमस्कार शेतकरी

source: Your Farming Records
hi: आपका खेती रेकॉर्ड
mr: तुमचे शेतीचे नोंदी

# addYourFarmingRecord
source: Add your farming record and track everything in one place
hi: अपना खेती रेकॉर्ड जोड़ें और सब कुछ एक ही जगह ट्रैक करें
mr: तुमची शेती नोंद जोडा आणि सर्व काही एका ठिकाणी ट्रॅक करा

source: See All
hi: सभी देखें
mr: सर्व पहा

source: View Details
hi: विवरण देखें
mr: तपशील पहा

source: Add New Record
hi: नया रेकॉर्ड जोड़ें
mr: नवीन नोंद जोडा

# noRecordsYet
source: No records yet. Please add a farm first!
hi: अभी तक कोई रेकॉर्ड नहीं है। पहले फार्म को जोड़ें!
mr: अजून कोणत्याही नोंदी नाहीत. कृपया प्रथम शेत जोडा!

# todayTasks
source: Today's Tasks
hi: आज के कार्य
mr: आजची कामे

source: Completed Tasks
hi: पूरा किए गए कार्य
mr: पूर्ण केलेली कामे

source: Pending Tasks
hi: लंबित कार्य
mr: प्रलंबित कामे

source: View Schedule
hi: शेड्यूल देखें
mr: वेळापत्रक पहा

# tapToAddFarm
source: Tap + button to add a new farm
hi: नया फार्म जोड़ने के लिए + बटन दबाएं
mr: + बटणावर टॅप करा नवीन शेत जोडण्यासाठी

# noTasksToday
source: No tasks scheduled for today
hi: आज के लिए कोई कार्य निर्धारित नहीं है
mr: आज कोणतीही कामे नाहीत

# goodJob
source: Great job! Youâ€™ve completed all tasks for today!
hi: शाबाश! आपने आज के सभी कार्य पूरे कर लिए हैं!
mr: छान काम! तुम्ही आजची सर्व कामे पूर्ण केलीत!

source: Go to Reports
hi: रिपोर्ट्स पर जाएं
mr: अहवाल पहा

source: Farms
hi: फार्म्स
mr: शेते

source: Plots
hi: प्लॉट्स
mr: प्लॉट्स

source: Expenses
hi: खर्चे
mr: खर्च

source: Schedules
hi: शेड्यूल्स
mr: वेळापत्रके

# farmAddSuccess
source: Farm added successfully!
hi: फार्म सफलतापूर्वक जोड़ा गया!
mr: शेत यशस्वीरित्या जोडले!

source: Final Confirmation
hi: अंतिम पुष्टि
mr: अंतिम खात्री

# archiveWarning
source: This action will archive the farm along with its expenses. You can restore them later. Are you 100% sure?
hi: यह क्रिया फार्म को उसके खर्चों सहित संग्रहित कर देगी। आप उन्हें बाद में पुनः बहाल कर सकते हैं। क्या आप 100% सुनिश्चित हैं?
mr: ही कृती शेत आणि त्याचे सर्व खर्च संग्रहित करेल. तुम्ही ते नंतर पुन्हा प्राप्त करू शकता. तुम्ही 100% खात्रीत आहात का?

# archiveFailed
source: Failed to archive the farm. Please try again.
hi: फार्म संग्रहित करने में विफल। कृपया पुनः प्रयास करें।
mr: शेत संग्रहित करण्यात अयशस्वी. कृपया पुन्हा प्रयत्न करा.

# summaryLoadError
source: Error loading summary
hi: सारांश लोड करने में त्रुटि हुई
mr: सारांश लोड करण्यात त्रुटी

source: Expense
hi: खर्च
mr: खर्च

# pleaseFillAllInfo
source: Please fill all information
hi: कृपया सभी जानकारी भरें
mr: कृपया सर्व माहिती भरा

# webDataNotSaved
source: Data cannot be saved to the web
hi: वेब पर डेटा सहेजा नहीं जा सकता
mr: डेटा वेबवर सेव्ह केला जाऊ शकत नाही

# farmSaveError
source: There was an issue saving the farm!
hi: फार्म सहेजने में समस्या आई!
mr: शेत सेव्ह करण्यात अडचण आली!

source: Add New Farm
hi: नया फार्म जोड़ें
mr: नवीन शेत जोडा

# year
source: Year : 2025
hi: वर्ष : 2025
mr: वर्ष : 2025

source: Acre
hi: एकड़
mr: एकर

source: Hectare
hi: हेक्टेयर
mr: हेक्टर

source: Gunta
hi: गुंठा
mr: गुंटा

source: Square Meter
hi: वर्ग मीटर
mr: चौरस मीटर

source: Square Foot
hi: वर्ग फुट
mr: चौरस फूट

source: Enter Quantity
hi: मात्रा दर्ज करें
mr: प्रमाण भरा

# seedlingCount
source: Number of Seeds/Plants:
hi: बीज/रोपाई की संख्या:
mr: बियाणे/रोपांची संख्या:

source: Number
hi: संख्या
mr: संख्या

source: Dozen
hi: दर्जन
mr: डझन

source: Kilogram
hi: किलोग्राम
mr: किलोग्रॅम

source: Gram
hi: ग्राम
mr: ग्राम

source: Planting Date:
hi: रोपण तिथि:
mr: लागवड तारीख:

source: Select Planting Date
hi: रोपण तिथि चुनें
mr: लागवड तारीख निवडा

source: Farm Name:
hi: फार्म का नाम:
mr: शेताचे नाव:

source: Enter Farm Name
hi: फार्म का नाम दर्ज करें
mr: शेताचे नाव भरा

source: Area:
hi: क्षेत्र:
mr: क्षेत्र:

source: Select Work Type
hi: कार्य का प्रकार चुनें
mr: कामाचा प्रकार निवडा

source: Edit Expense
hi: खर्च संपादित करें
mr: खर्च संपादित करा

source: Add Expense
hi: खर्च जोड़ें
mr: खर्च जोडा

source: Date:
hi: तिथि:
mr: तारीख:

source: Seeds
hi: बीज
mr: बियाणे

source: Fertilizer
hi: उर्वरक
mr: खत

source: Labor
hi: श्रम
mr: मजुरी

source: Equipment
hi: उपकरण
mr: उपकरणे

source: Irrigation
hi: सिंचाई
mr: सिंचन

source: Harvesting
hi: फसल कटाई
mr: कापणी

source: Weeding
hi: निराई
mr: निंदणी

source: Pesticide Spraying
hi: कीटनाशक छिड़काव
mr: कीटकनाशक फवारणी

source: Planting
hi: रोपण
mr: लागवड

source: Pruning
hi: छंटाई
mr: फांद्या छाटणे

source: Soil Testing
hi: मृदा परीक्षण
mr: माती चाचणी

source: Composting
hi: कम्पोस्टिंग
mr: सेंद्रिय खत

source: Liters
hi: लीटर
mr: लिटर

source: Pieces
hi: टुकड़े
mr: तुकडे

source: Enter Amount
hi: राशि दर्ज करें
mr: रक्कम भरा

# amountRequired
source: Amount is required
hi: राशि आवश्यक है
mr: रक्कम आवश्यक आहे

source: Work Description
hi: कार्य विवरण
mr: कामाचे वर्णन

source: Enter Work Description
hi: कार्य विवरण दर्ज करें
mr: कामाचे वर्णन भरा

source: Receipts:
hi: रसीदें:
mr: पावत्या:

# pleaseFillAllFields
source: Please fill all required fields correctly
hi: कृपया सभी आवश्यक फ़ील्ड सही तरीके से भरें
mr: कृपया सर्व आवश्यक माहिती योग्य प्रकारे भरा

source: Record Work/Expense
hi: कार्य/खर्च दर्ज करें
mr: काम/खर्च नोंदवा

# quantityUnitRequired
source: Quantity and Unit are required
hi: मात्रा और इकाई आवश्यक हैं
mr: प्रमाण व एकक आवश्यक आहे

# workNameRequired
source: Work name is required
hi: कार्य का नाम आवश्यक है
mr: कामाचे नाव आवश्यक आहे

source: Work Name:
hi: कार्य का नाम:
mr: कामाचे नाव:

source: Enter Work Name
hi: कार्य का नाम दर्ज करें
mr: कामाचे नाव भरा

# quantityRequired
source: Quantity is required
hi: मात्रा आवश्यक है
mr: प्रमाण आवश्यक आहे

# enterValidNumber
source: Enter a valid number
hi: एक मान्य संख्या दर्ज करें
mr: वैध संख्या भरा

source: Unit:
hi: इकाई:
mr: एकक:

# unitRequired
source: Unit is required
hi: इकाई आवश्यक है
mr: एकक आवश्यक आहे

# failedToSaveExpense
source: Failed to save expense. Please try again.
hi: खर्च सहेजने में विफल। कृपया पुनः प्रयास करें।
mr: खर्च सेव्ह करण्यात अयशस्वी. कृपया पुन्हा प्रयत्न करा.

# enterNameAndLocation
source: Please enter both name and location!
hi: कृपया नाम और स्थान दोनों दर्ज करें!
mr: कृपया नाव आणि स्थान दोन्ही भरा!

# failedToUpdateFarm
source: Failed to update farm. Please try again!
hi: फार्म अपडेट करने में विफल। कृपया पुनः प्रयास करें!
mr: शेत अपडेट करण्यात अयशस्वी. कृपया पुन्हा प्रयत्न करा!

source: Edit Farm Details
hi: फार्म विवरण संपादित करें
mr: शेत तपशील संपादित करा

source: Location
hi: स्थान
mr: स्थान

source: Update Farm
hi: फार्म अपडेट करें
mr: शेत अपडेट करा

source: Close
hi: बंद करें
mr: बंद करा

# expenseUpdatedSuccess
source: Expense updated successfully!
hi: खर्च सफलतापूर्वक अपडेट किया गया!
mr: खर्च यशस्वीरित्या अद्ययावत झाला!

source: Archive Expense?
hi: क्या खर्च संग्रहित करें?
mr: खर्च संग्रहित करायचा आहे?

# archiveExpenseConfirmation
source: Are you sure you want to archive this expense?
hi: क्या आप वाकई इस खर्च को संग्रहित करना चाहते हैं?
mr: तुम्हाला खात्री आहे का की हा खर्च संग्रहित करायचा आहे?

source: Archive
hi: संग्रहित करें
mr: संग्रहित करा

# expenseArchivedSuccess
source: Expense archived successfully!
hi: खर्च सफलतापूर्वक संग्रहित किया गया!
mr: खर्च यशस्वीरित्या संग्रहित झाला!

# expenseArchiveFailed
source: Failed to archive expense. Please try again.
hi: खर्च संग्रहित करने में विफल। कृपया पुनः प्रयास करें।
mr: खर्च संग्रहित करण्यात अयशस्वी. कृपया पुन्हा प्रयत्न करा.

source: No expenses found.
hi: कोई खर्च नहीं मिला।
mr: कोणतेही खर्च सापडले नाहीत.

source: Category
hi: श्रेणी
mr: श्रेणी

source: Description
hi: विवरण
mr: वर्णन

source: Amount:
hi: राशि
mr: रक्कम:

# downloadCompletedAllFarms
source: Download completed for all farms
hi: सभी फार्मों के लिए डाउनलोड पूर्ण हुआ
mr: सर्व शेतांसाठी डाउनलोड पूर्ण झाले

source: Downloading all farms report...
hi: सभी फार्मों की रिपोर्ट डाउनलोड हो रही है...
mr: सर्व शेतांच्या अहवालाची डाउनलोड चालू आहे...

source: Download Data
hi: डेटा डाउनलोड करें
mr: डेटा डाउनलोड करा

source: Info
hi: जानकारी
mr: माहिती

source: Help
hi: मदद
mr: मदत

# tapToDownloadHelp
source: Tap on a farm to download its report, or use the button above to download all.
hi: किसी फार्म पर टैप करके उसकी रिपोर्ट डाउनलोड करें, या ऊपर दिए गए बटन से सभी डाउनलोड करें।
mr: शेतावर टॅप करून त्याचा अहवाल डाउनलोड करा, किंवा वरच्या बटणाने सर्व डाउनलोड करा.

source: OK
hi: ठीक है
mr: ठीक

source: Download All Farms Data
hi: सभी फार्म डेटा डाउनलोड करें
mr: सर्व शेतांचा डेटा डाउनलोड करा

# failedToArchiveExpense
source: Failed to archive expense. Please try again.
hi: व्यय आर्काइव करने में विफल। कृपया पुनः प्रयास करें।
mr: खर्च संग्रहित करण्यात अयशस्वी. कृपया पुन्हा प्रयत्न करा.

source: Day-wise Expenses
hi: दिवसवार खर्च
mr: दिवसानुसार खर्च

source: Unknown Farm
hi: अज्ञात खेत
mr: अज्ञात शेत

# select_crop_category
source: Please select a crop category to continue.
hi: कृपया जारी रखने के लिए एक फसल श्रेणी का चयन करें।
mr: कृपया पुढे जाण्यासाठी एक पीक श्रेणी निवडा.

# otherCrop
source: Other
hi: अन्य
mr: इतर

source: Enter Crop Name
hi: फसल का नाम दर्ज करें
mr: पीक नाव प्रविष्ट करा

source: Enter here...
hi: यहां दर्ज करें...
mr: येथे प्रविष्ट करा...

source: Cancel
hi: रद्द करें
mr: रद्द करा

source: Expense Records
hi: खर्च रिकार्ड्स
mr: खर्च नोंदी

source: Crop
hi: फसल
mr: पिक

source: Total
hi: कुल
mr: एकूण

source: Download completed:
hi: डाउनलोड पूरा हुआ:
mr: डाउनलोड पूर्ण:

source: Failed to generate PDF
hi: PDF बनाने में विफल
mr: PDF तयार करण्यात अयशस्वी

source: PDF error:
hi: PDF त्रुटि:
mr: PDF त्रुटी:

source: No expense records.
hi: कोई खर्च का रिकॉर्ड नहीं है।
mr: खर्चाची नोंद नाही.
